Revert "content: Elasticsearch 深度补充 - 搜索核心章节重写"
This reverts commit 29c41167e2ae02db199474edbc70ede5b0cc018a.
